cfg/InformationRegisters/СведенияОЛицахСДополнительнымиГарантиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОЛицахСДополнительнымиГарантиями</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаличиеГарантий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГарантии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеГарантииВСодействииТрудоустройству</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/СведенияОЛицахСДополнительнымиГарантиями/Forms/ФормаЗаписи/Ext/Form/Module.bsl
Перем мФизЛицо; // сохраняем физлицо, данные которого начинали редактировать

Процедура УстановитьДоступность()
	
	ЭлементыФормы.ВидГарантии.Доступность = НаличиеГарантий;
	
КонецПроцедуры	

Процедура ПериодПриИзменении(Элемент)
	Если Элемент.Значение > РабочаяДата Тогда
		Ответ = Вопрос(НСтр("ru='Вы действительно хотите ввести данные';uk='Ви дійсно хочете ввести дані'") + Символы.ПС + НСтр("ru='о дополнительных гарантиях физлица на будущую дату?';uk='про додаткові гарантії фізособи на майбутню дату?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Элемент.Значение = РабочаяДата
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ФизЛицоПриИзменении(Элемент)
	Заголовок = НСтр("ru='Сведения о лицах с дополнительными гарантиями: ';uk='Відомості про осіб з додатковими гарантіями: '") + Элемент.Значение.Наименование
КонецПроцедуры


Процедура ПриОткрытии()
	Заголовок = НСтр("ru='Сведения о лицах с дополнительными гарантиями: ';uk='Відомості про осіб з додатковими гарантіями: '") + ФизЛицо.Наименование;
	мФизЛицо = ФизЛицо;
КонецПроцедуры

Процедура ПослеЗаписи()
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","НаличиеГарантий"), ФизЛицо);
	Если мФизЛицо <> ФизЛицо Тогда
        // оповестим также форму того физлица, данные которого начинали редактировать
		Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","НаличиеГарантий"), мФизЛицо);
		мФизЛицо = ФизЛицо;
	КонецЕсли;
КонецПроцедуры

Процедура НаличиеГарантийПриИзменении(Элемент)
	
	Если НЕ НаличиеГарантий Тогда
		ВидГарантии = Справочники.ДополнительныеГарантииВСодействииТрудоустройству.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры
